
# State **`s3://infrahouse-aws-s3-control/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |    Destroy |
|:---------:|--------:|-----------:|-----------:|
|     ✅     |       4 |          3 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                             |
|:--------:|:------------------------------------------------------------------------------------------------------|
|    🟢     | `module.buckets["infrahouse-aws-control"].aws_s3_bucket.state-bucket`                                 |
|    🟢     | `module.buckets["infrahouse-aws-control"].aws_s3_bucket_public_access_block.public_access`            |
|    🟢     | `module.buckets["infrahouse-aws-control"].aws_s3_bucket_server_side_encryption_configuration.default` |
|    🟢     | `module.buckets["infrahouse-aws-control"].aws_s3_bucket_versioning.enabled`                           |
|    🟢     | `module.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket:`                               |
|    🟡     | `module.buckets["infrahouse-aws-s3-control"].aws_s3_bucket.state-bucket`                              |
|    🟡     | `module.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket`                                |
|    🟡     | `module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket`                               |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/676b5ea0-1d77-41eb-aecf-4ad5dad28661/terraform-bin plan -var-file=configuration.tfvars --out=tf.plan
module.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-aws-s3-control"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-s3-control]
module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-website-infra]
module.buckets["infrahouse-website-infra"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-website-infra]
module.buckets["infrahouse-website-infra"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-website-infra]
module.buckets["infrahouse-aws-s3-control"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-s3-control]
module.buckets["infrahouse-website-infra"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-website-infra]
module.buckets["infrahouse-github-state"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-github-state"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-aws-s3-control"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-s3-control]
module.buckets["infrahouse-aws-s3-control"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-s3-control]
module.buckets["infrahouse-github-state"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-state]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.buckets["infrahouse-aws-control"].aws_s3_bucket.state-bucket will be created
  + resource "aws_s3_bucket" "state-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "infrahouse-aws-control"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "created_by"  = "infrahouse8/aws-s3-control"
          + "description" = "Terraform state for https://github.com/infrahouse/infrahouse-aws-control"
        }
      + tags_all                    = {
          + "created_by"  = "infrahouse8/aws-s3-control"
          + "description" = "Terraform state for https://github.com/infrahouse/infrahouse-aws-control"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.buckets["infrahouse-aws-control"].aws_s3_bucket_public_access_block.public_access will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.buckets["infrahouse-aws-control"].aws_s3_bucket_server_side_encryption_configuration.default will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "default" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.buckets["infrahouse-aws-control"].aws_s3_bucket_versioning.enabled will be created
  + resource "aws_s3_bucket_versioning" "enabled" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.buckets["infrahouse-aws-s3-control"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-s3-control"
      ~ tags                        = {
            "created_by"  = "infrahouse8/aws-s3-control"
          + "description" = "Terraform state for https://github.com/infrahouse8/aws-s3-control"
        }
      ~ tags_all                    = {
          + "description" = "Terraform state for https://github.com/infrahouse8/aws-s3-control"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-github-state"
      ~ tags                        = {
            "created_by"  = "infrahouse8/aws-s3-control"
          + "description" = "Terraform state for https://github.com/infrahouse8/github-control"
        }
      ~ tags_all                    = {
          + "description" = "Terraform state for https://github.com/infrahouse8/github-control"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-website-infra"
      ~ tags                        = {
            "created_by"  = "infrahouse8/aws-s3-control"
          + "description" = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"
        }
      ~ tags_all                    = {
          + "description" = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 4 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 0.
::debug::stdout: module.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-aws-s3-control"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-s3-control]%0Amodule.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-website-infra]%0Amodule.buckets["infrahouse-website-infra"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-website-infra]%0Amodule.buckets["infrahouse-website-infra"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-website-infra]%0Amodule.buckets["infrahouse-aws-s3-control"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-s3-control]%0Amodule.buckets["infrahouse-website-infra"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-website-infra]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-aws-s3-control"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-s3-control]%0Amodule.buckets["infrahouse-aws-s3-control"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-s3-control]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-state]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.buckets["infrahouse-aws-control"].aws_s3_bucket.state-bucket will be created%0A  + resource "aws_s3_bucket" "state-bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "infrahouse-aws-control"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "created_by"  = "infrahouse8/aws-s3-control"%0A          + "description" = "Terraform state for https://github.com/infrahouse/infrahouse-aws-control"%0A        }%0A      + tags_all                    = {%0A          + "created_by"  = "infrahouse8/aws-s3-control"%0A          + "description" = "Terraform state for https://github.com/infrahouse/infrahouse-aws-control"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.buckets["infrahouse-aws-control"].aws_s3_bucket_public_access_block.public_access will be created%0A  + resource "aws_s3_bucket_public_access_block" "public_access" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + restrict_public_buckets = true%0A    }%0A%0A  # module.buckets["infrahouse-aws-control"].aws_s3_bucket_server_side_encryption_configuration.default will be created%0A  + resource "aws_s3_bucket_server_side_encryption_configuration" "default" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + rule {%0A          + apply_server_side_encryption_by_default {%0A              + sse_algorithm = "AES256"%0A            }%0A        }%0A    }%0A%0A  # module.buckets["infrahouse-aws-control"].aws_s3_bucket_versioning.enabled will be created%0A  + resource "aws_s3_bucket_versioning" "enabled" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0A  # module.buckets["infrahouse-aws-s3-control"].aws_s3_bucket.state-bucket will be updated in-place%0A  ~ resource "aws_s3_bucket" "state-bucket" {%0A        id                          = "infrahouse-aws-s3-control"%0A      ~ tags                        = {%0A            "created_by"  = "infrahouse8/aws-s3-control"%0A          + "description" = "Terraform state for https://github.com/infrahouse8/aws-s3-control"%0A        }%0A      ~ tags_all                    = {%0A          + "description" = "Terraform state for https://github.com/infrahouse8/aws-s3-control"%0A            # (1 unchanged element hidden)%0A        }%0A        # (9 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket will be updated in-place%0A  ~ resource "aws_s3_bucket" "state-bucket" {%0A        id                          = "infrahouse-github-state"%0A      ~ tags                        = {%0A            "created_by"  = "infrahouse8/aws-s3-control"%0A          + "description" = "Terraform state for https://github.com/infrahouse8/github-control"%0A        }%0A      ~ tags_all                    = {%0A          + "description" = "Terraform state for https://github.com/infrahouse8/github-control"%0A            # (1 unchanged element hidden)%0A        }%0A        # (9 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket will be updated in-place%0A  ~ resource "aws_s3_bucket" "state-bucket" {%0A        id                          = "infrahouse-website-infra"%0A      ~ tags                        = {%0A            "created_by"  = "infrahouse8/aws-s3-control"%0A          + "description" = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"%0A        }%0A      ~ tags_all                    = {%0A          + "description" = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"%0A            # (1 unchanged element hidden)%0A        }%0A        # (9 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0APlan: 4 to add, 3 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLXMzLWNvbnRyb2wvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAic3Rkb3V0IjogIltjb21tYW5kXS9ob21lL3J1bm5lci93b3JrL190ZW1wLzY3NmI1ZWEwLTFkNzctNDFlYi1hZWNmLTRhZDVkYWQyODY2MS90ZXJyYWZvcm0tYmluIHBsYW4gLXZhci1maWxlPWNvbmZpZ3VyYXRpb24udGZ2YXJzIC0tb3V0PXRmLnBsYW5cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1zMy1jb250cm9sXCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1zMy1jb250cm9sXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLXMzLWNvbnRyb2xcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLXMzLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItc3RhdGVdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1zMy1jb250cm9sXCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLXMzLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLXMzLWNvbnRyb2xcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLXMzLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZV1cdTAwMWJbMG1cblxuVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvblxucGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOlxuICBcdTAwMWJbMzJtK1x1MDAxYlswbSBjcmVhdGVcdTAwMWJbMG1cbiAgXHUwMDFiWzMzbX5cdTAwMWJbMG0gdXBkYXRlIGluLXBsYWNlXHUwMDFiWzBtXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0XHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZFxuXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImF3c19zM19idWNrZXRcIiBcInN0YXRlLWJ1Y2tldFwiIHtcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFjY2VsZXJhdGlvbl9zdGF0dXMgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFjbCAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFybiAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGJ1Y2tldCAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBidWNrZXRfZG9tYWluX25hbWUgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBidWNrZXRfcmVnaW9uYWxfZG9tYWluX25hbWUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBmb3JjZV9kZXN0cm95ICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gaG9zdGVkX3pvbmVfaWQgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gb2JqZWN0X2xvY2tfZW5hYmxlZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcG9saWN5ICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVnaW9uICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVxdWVzdF9wYXllciAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdGFncyAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZTgvYXdzLXMzLWNvbnRyb2xcIlxuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9pbmZyYWhvdXNlLWF3cy1jb250cm9sXCJcbiAgICAgICAgfVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdGFnc19hbGwgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZTgvYXdzLXMzLWNvbnRyb2xcIlxuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9pbmZyYWhvdXNlLWF3cy1jb250cm9sXCJcbiAgICAgICAgfVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gd2Vic2l0ZV9kb21haW4gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gd2Vic2l0ZV9lbmRwb2ludCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuXHUwMDFiWzFtICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2Vzc1x1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWRcblx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2tcIiBcInB1YmxpY19hY2Nlc3NcIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBibG9ja19wdWJsaWNfYWNscyAgICAgICA9IHRydWVcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGJsb2NrX3B1YmxpY19wb2xpY3kgICAgID0gdHJ1ZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYnVja2V0ICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGlnbm9yZV9wdWJsaWNfYWNscyAgICAgID0gdHJ1ZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzdHJpY3RfcHVibGljX2J1Y2tldHMgPSB0cnVlXG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHRcdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXG5cdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb25cIiBcImRlZmF1bHRcIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBidWNrZXQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG5cbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJ1bGUge1xuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFwcGx5X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fYnlfZGVmYXVsdCB7XG4gICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHNzZV9hbGdvcml0aG0gPSBcIkFFUzI1NlwiXG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICB9XG5cblx1MDAxYlsxbSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWRcdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXG5cdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nXCIgXCJlbmFibGVkXCIge1xuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYnVja2V0ID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gaWQgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB2ZXJzaW9uaW5nX2NvbmZpZ3VyYXRpb24ge1xuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIG1mYV9kZWxldGUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gc3RhdHVzICAgICA9IFwiRW5hYmxlZFwiXG4gICAgICAgIH1cbiAgICB9XG5cblx1MDAxYlsxbSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLXMzLWNvbnRyb2xcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXRcdTAwMWJbMG0gd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG5cdTAwMWJbMG0gIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldFwiIFwic3RhdGUtYnVja2V0XCIge1xuICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLXMzLWNvbnRyb2xcIlxuICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gdGFncyAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICAgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlOC9hd3MtczMtY29udHJvbFwiXG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gXCJkZXNjcmlwdGlvblwiID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlOC9hd3MtczMtY29udHJvbFwiXG4gICAgICAgIH1cbiAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBcImRlc2NyaXB0aW9uXCIgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2U4L2F3cy1zMy1jb250cm9sXCJcbiAgICAgICAgICAgIFx1MDAxYls5MG0jICgxIHVuY2hhbmdlZCBlbGVtZW50IGhpZGRlbilcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgICAgfVxuICAgICAgICBcdTAwMWJbOTBtIyAoOSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtXG5cbiAgICAgICAgXHUwMDFiWzkwbSMgKDMgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldFx1MDAxYlswbSB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2Vcblx1MDAxYlswbSAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0XCIgXCJzdGF0ZS1idWNrZXRcIiB7XG4gICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIlxuICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gdGFncyAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICAgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlOC9hd3MtczMtY29udHJvbFwiXG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gXCJkZXNjcmlwdGlvblwiID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlOC9naXRodWItY29udHJvbFwiXG4gICAgICAgIH1cbiAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBcImRlc2NyaXB0aW9uXCIgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2U4L2dpdGh1Yi1jb250cm9sXCJcbiAgICAgICAgICAgIFx1MDAxYls5MG0jICgxIHVuY2hhbmdlZCBlbGVtZW50IGhpZGRlbilcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICAgICAgfVxuICAgICAgICBcdTAwMWJbOTBtIyAoOSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtXG5cbiAgICAgICAgXHUwMDFiWzkwbSMgKDMgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtXG4gICAgfVxuXG5cdTAwMWJbMW0gICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXRcdTAwMWJbMG0gd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG5cdTAwMWJbMG0gIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldFwiIFwic3RhdGUtYnVja2V0XCIge1xuICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXG4gICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgICBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2U4L2F3cy1zMy1jb250cm9sXCJcbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBcImRlc2NyaXB0aW9uXCIgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJcbiAgICAgICAgfVxuICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gdGFnc19hbGwgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIlxuICAgICAgICAgICAgXHUwMDFiWzkwbSMgKDEgdW5jaGFuZ2VkIGVsZW1lbnQgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbVxuICAgICAgICB9XG4gICAgICAgIFx1MDAxYls5MG0jICg5IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcdTAwMWJbMG1cdTAwMWJbMG1cblxuICAgICAgICBcdTAwMWJbOTBtIyAoMyB1bmNoYW5nZWQgYmxvY2tzIGhpZGRlbilcdTAwMWJbMG1cdTAwMWJbMG1cbiAgICB9XG5cblx1MDAxYlsxbVBsYW46XHUwMDFiWzBtIDQgdG8gYWRkLCAzIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LlxuXHUwMDFiWzBtXHUwMDFiWzkwbVxuXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUwMDFiWzBtXG5cblNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuXG5cblRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OlxuICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIlxuUmVsZWFzaW5nIHN0YXRlIGxvY2suIFRoaXMgbWF5IHRha2UgYSBmZXcgbW9tZW50cy4uLlxuOjpkZWJ1Zzo6VGVycmFmb3JtIGV4aXRlZCB3aXRoIGNvZGUgMC5cbjo6ZGVidWc6OnN0ZG91dDogXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItc3RhdGVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1zMy1jb250cm9sXCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1zMy1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1zMy1jb250cm9sXCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1zMy1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItc3RhdGVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLXMzLWNvbnRyb2xcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtczMtY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLXMzLWNvbnRyb2xcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLXMzLWNvbnRyb2xdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItc3RhdGVdXHUwMDFiWzBtJTBBJTBBVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvbiUwQXBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczolMEEgIFx1MDAxYlszMm0rXHUwMDFiWzBtIGNyZWF0ZVx1MDAxYlswbSUwQSAgXHUwMDFiWzMzbX5cdTAwMWJbMG0gdXBkYXRlIGluLXBsYWNlXHUwMDFiWzBtJTBBJTBBVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6JTBBJTBBXHUwMDFiWzFtICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldFx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWQlMEFcdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldFwiIFwic3RhdGUtYnVja2V0XCIgeyUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFjY2VsZXJhdGlvbl9zdGF0dXMgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBhY2wgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYXJuICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGJ1Y2tldCAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYnVja2V0X2RvbWFpbl9uYW1lICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGJ1Y2tldF9yZWdpb25hbF9kb21haW5fbmFtZSA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBmb3JjZV9kZXN0cm95ICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGhvc3RlZF96b25lX2lkICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gb2JqZWN0X2xvY2tfZW5hYmxlZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHBvbGljeSAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZWdpb24gICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVxdWVzdF9wYXllciAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlOC9hd3MtczMtY29udHJvbFwiJTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9pbmZyYWhvdXNlLWF3cy1jb250cm9sXCIlMEEgICAgICAgIH0lMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZTgvYXdzLXMzLWNvbnRyb2xcIiUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBcImRlc2NyaXB0aW9uXCIgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvaW5mcmFob3VzZS1hd3MtY29udHJvbFwiJTBBICAgICAgICB9JTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gd2Vic2l0ZV9kb21haW4gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHdlYnNpdGVfZW5kcG9pbnQgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQVx1MDAxYlsxbSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3NcdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkJTBBXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9ja1wiIFwicHVibGljX2FjY2Vzc1wiIHslMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBibG9ja19wdWJsaWNfYWNscyAgICAgICA9IHRydWUlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBibG9ja19wdWJsaWNfcG9saWN5ICAgICA9IHRydWUlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBidWNrZXQgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZ25vcmVfcHVibGljX2FjbHMgICAgICA9IHRydWUlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXN0cmljdF9wdWJsaWNfYnVja2V0cyA9IHRydWUlMEEgICAgfSUwQSUwQVx1MDAxYlsxbSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdFx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWQlMEFcdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb25cIiBcImRlZmF1bHRcIiB7JTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYnVja2V0ID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGlkICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEElMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBydWxlIHslMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYXBwbHlfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9ieV9kZWZhdWx0IHslMEEgICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHNzZV9hbGdvcml0aG0gPSBcIkFFUzI1NlwiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBXHUwMDFiWzFtICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZFx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWQlMEFcdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nXCIgXCJlbmFibGVkXCIgeyUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGJ1Y2tldCA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdmVyc2lvbmluZ19jb25maWd1cmF0aW9uIHslMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gbWZhX2RlbGV0ZSA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gc3RhdHVzICAgICA9IFwiRW5hYmxlZFwiJTBBICAgICAgICB9JTBBICAgIH0lMEElMEFcdTAwMWJbMW0gICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1zMy1jb250cm9sXCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0XHUwMDFiWzBtIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZSUwQVx1MDAxYlswbSAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0XCIgXCJzdGF0ZS1idWNrZXRcIiB7JTBBICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLXMzLWNvbnRyb2xcIiUwQSAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgICBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2U4L2F3cy1zMy1jb250cm9sXCIlMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gXCJkZXNjcmlwdGlvblwiID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlOC9hd3MtczMtY29udHJvbFwiJTBBICAgICAgICB9JTBBICAgICAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gdGFnc19hbGwgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBcImRlc2NyaXB0aW9uXCIgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2U4L2F3cy1zMy1jb250cm9sXCIlMEEgICAgICAgICAgICBcdTAwMWJbOTBtIyAoMSB1bmNoYW5nZWQgZWxlbWVudCBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtJTBBICAgICAgICB9JTBBICAgICAgICBcdTAwMWJbOTBtIyAoOSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtJTBBJTBBICAgICAgICBcdTAwMWJbOTBtIyAoMyB1bmNoYW5nZWQgYmxvY2tzIGhpZGRlbilcdTAwMWJbMG1cdTAwMWJbMG0lMEEgICAgfSUwQSUwQVx1MDAxYlsxbSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0XHUwMDFiWzBtIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZSUwQVx1MDAxYlswbSAgXHUwMDFiWzMzbX5cdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0XCIgXCJzdGF0ZS1idWNrZXRcIiB7JTBBICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCIlMEEgICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICAgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlOC9hd3MtczMtY29udHJvbFwiJTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZTgvZ2l0aHViLWNvbnRyb2xcIiUwQSAgICAgICAgfSUwQSAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gXCJkZXNjcmlwdGlvblwiID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlOC9naXRodWItY29udHJvbFwiJTBBICAgICAgICAgICAgXHUwMDFiWzkwbSMgKDEgdW5jaGFuZ2VkIGVsZW1lbnQgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbSUwQSAgICAgICAgfSUwQSAgICAgICAgXHUwMDFiWzkwbSMgKDkgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbSUwQSUwQSAgICAgICAgXHUwMDFiWzkwbSMgKDMgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtJTBBICAgIH0lMEElMEFcdTAwMWJbMW0gICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXRcdTAwMWJbMG0gd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlJTBBXHUwMDFiWzBtICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImF3c19zM19idWNrZXRcIiBcInN0YXRlLWJ1Y2tldFwiIHslMEEgICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCIlMEEgICAgICBcdTAwMWJbMzNtflx1MDAxYlswbVx1MDAxYlswbSB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICAgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlOC9hd3MtczMtY29udHJvbFwiJTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIiUwQSAgICAgICAgfSUwQSAgICAgIFx1MDAxYlszM21+XHUwMDFiWzBtXHUwMDFiWzBtIHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gXCJkZXNjcmlwdGlvblwiID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiJTBBICAgICAgICAgICAgXHUwMDFiWzkwbSMgKDEgdW5jaGFuZ2VkIGVsZW1lbnQgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbSUwQSAgICAgICAgfSUwQSAgICAgICAgXHUwMDFiWzkwbSMgKDkgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVx1MDAxYlswbVx1MDAxYlswbSUwQSUwQSAgICAgICAgXHUwMDFiWzkwbSMgKDMgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pXHUwMDFiWzBtXHUwMDFiWzBtJTBBICAgIH0lMEElMEFcdTAwMWJbMW1QbGFuOlx1MDAxYlswbSA0IHRvIGFkZCwgMyB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS4lMEFcdTAwMWJbMG1cdTAwMWJbOTBtJTBBXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUwMDFiWzBtJTBBJTBBU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW4lMEElMEFUbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTolMEEgICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiJTBBUmVsZWFzaW5nIHN0YXRlIGxvY2suIFRoaXMgbWF5IHRha2UgYSBmZXcgbW9tZW50cy4uLiUwQVxuOjpkZWJ1Zzo6c3RkZXJyOiBcbjo6ZGVidWc6OmV4aXRjb2RlOiAwXG4iLCAic3RkZXJyIjogIiIsICJhZGQiOiA0LCAiY2hhbmdlIjogMywgImRlc3Ryb3kiOiAwfX0=```
</p></details>